from langchain_community.chat_models.tongyi import ChatTongyi

model = ChatTongyi(model = "qwen3-max")

# message = [
#   SystemMessage(content="你是一个网文作者，擅长写玄幻小说"),
#   HumanMessage(content="请生成一个一份小说大纲，以混沌，长城等为元素"),
#   AIMessage(content="伊始，至高存在于虚无中降下创世之言，诞生万千世界，混沌伴生，伏于诸多世界之中。其中一方世界，孕育出最早的生灵—古。古的一生都在与混沌战斗，终身化天地，灵化此方天地的源，将混沌压制在外。万千岁月后荒古纪，修士劫嫉妒兄弟简，受混沌气息蛊惑侵蚀，成为混沌神祇，原本压制混沌的天地大道出现缺口，混沌入侵，引发洪荒浩劫！被侵蚀的生灵成为劫族。简帝率一众修士以身为碑，化作裂界长城，将混沌隔绝于长城之外，此后界外为劫地，界内镇守裂界长城关口为诸天，诸天之下为九州四海，界内诸多知晓真相的修士自发组成了守卫裂界长城的组织——守碑人。"),
#   HumanMessage(content="完善小说大纲，添加更多元素")
# ]

message = [
  ("system" , "你是一个古代的文学作者，擅长写记体散文"),
  ("human" , "请写一个关于冼太庙的记体散文"),
  ("ai" , "高凉山水，郁乎苍苍。其间有庙翼然，俎豆千秋，祀我冼太夫人者。余尝过其下，仰瞻遗像，俯读残碑，想见当时之烈，喟然叹曰：此巾帼而须眉者，百世之英杰也！维夫人之先，盖百越之酋。当梁陈之际，中原板荡，岭表沸羹。夫人以女子之身，秉沉毅之姿，抚诸峒，怀百越，明约束，行信义。其用兵也，如雷霆之威；其安民也，若春风之煦。每戒子孙曰：“我事三朝，惟用一好心。”此七字者，实贯金石而泣鬼神者欤！入庙门，见廊庑间列鼓吹仪仗，犹存俚僚之旧俗。桄榔垂荫，蕉叶摇青，想见当时立马高凉，指麾三军，椎结金珰，象箸犀渠。而今香火氤氲中，妇孺膜拜，祈者非为金戈铁马之事，乃求蚕桑丰稔、儿女康宁。然非夫人昔时戡乱保境，安得今日太平之祀乎？庭有古榕，虬枝蔽日，垂须如戟。土人言：此夫人系马树也。每风过檐铃，铮然作响，犹闻当年铁甲之声。碑碣剥落，苔痕斑驳，惟“谯国夫人”四字尚可辨识。想冯仆九岁入朝，陈主惊其应对；冼智千里请命，隋帝嘉其忠诚。一门忠贞，皆夫人教也。嗟乎！丈夫徇名，烈士徇义，然如夫人之智勇兼备、恩威并济，处乱世而全宗族，事异姓而保乡邦，岂非天挺人豪，特生此崛奇女子耶？今海宇承平，而庙貌巍然，过者必式。盖人心所向，在安与定；天道所存，曰正曰诚。此岂非夫人“好心”之验乎？夕阳在山，归鸦阵阵。回望庙脊鸱吻，矗立苍茫，恍见夫人锦伞宝旄，巡行天际，护此高凉一片土也。"),
  ("human" , "请再写一篇关于粤西第一位状元林召棠的记体散文，是你在参观林召棠故居之后有感而发"),
]

res = model.stream(input = message)

for chunk in res:
  print(chunk.content, end="", flush=True)
